List destinationList = [
  ["북촌한옥마을", "Bukchon Hanok Village"],
  ["더현대 서울", "The Hyundai Seoul"],
  ["익선동 한옥 거리", "Ikseondong Hanok Street"],
  ["경복궁", "Gyeongbokgung Palace"],
  ["광장 시장", "Gwangjang Market"],
  ["반포한강공원", "Banpo Hangang Park"],
  ["남산공원 N서울타워", "Namsan Park N Seoul Tower"],
  ["낙산공원", "Naksan Park"],
  ["창덕궁", "Changdeokgung Palace"],
  ["덕수궁", "Deoksugung Palace"]
];

Map destinationMap = {
  "0": ['커피.3(coffee.3)', '음식점'],
  "1": ['화덕피자&파스타', '음식점'],
  "2": ['도로도로커피숍', '카페'],
  "3": ['종로맛집', '음식점'],
  "4": ['온 미 정', '음식점'],
  "5": ['피자파는집', '음식점'],
  "6": ['피팝 더 청담', '카페'],
  "7": ['한집한밥', '음식점'],
  "8": ['아이씨비와이', '음식점'],
  "9": ['참좋은참치', '음식점']
};

int random_i = 1;

List<Map> destinationMapRandom = [{
  "0": ['커피.3(coffee.3)', '음식점'],
  "1": ['화덕피자&파스타', '음식점'],
  "2": ['도로도로커피숍', '카페'],
  "3": ['종로맛집', '음식점'],
  "4": ['온 미 정', '음식점'],
  "5": ['피자파는집', '음식점'],
  "6": ['피팝 더 청담', '카페'],
  "7": ['한집한밥', '음식점'],
  "8": ['아이씨비와이', '음식점'],
  "9": ['참좋은참치', '음식점']
},
  {
    '0': ['커피.3(coffee.3)', '음식점'],
    '1': ['화덕피자&파스타', '음식점'],
    '2': ['도로도로커피숍', '카페'],
    '3': ['종로맛집', '음식점'],
    '4': ['온 미 정', '음식점'],
    '5': ['여기루', '음식점'],
    '6': ['한집한밥', '음식점'],
    '7': ['아이씨비와이', '음식점'],
    '8': ['스시앤스시', '음식점'],
    '9': ['피자파는집', '음식점'],
  },

  {
    '0': ['커피.3(coffee.3)', '음식점'],
    '1': ['화덕피자&파스타', '음식점'],
    '2': ['도로도로커피숍', '카페'],
    '3': ['온 미 정', '음식점'],
    '4': ['종로맛집', '음식점'],
    '5': ['아이씨비와이', '음식점'],
    '6': ['피자파는집', '음식점'],
    '7': ['한집한밥', '음식점'],
    '8': ['참좋은참치', '음식점'],
    '9': ['기사', '음식점'],
  },

  {
    '0': ['커피.3(coffee.3)', '음식점'],
    '1': ['화덕피자&파스타', '음식점'],
    '2': ['피팝 더 청담', '카페'],
    '3': ['도로도로커피숍', '카페'],
    '4': ['여기루', '음식점'],
    '5': ['종로맛집', '음식점'],
    '6': ['한집한밥', '음식점'],
    '7': ['온 미 정', '음식점'],
    '8': ['아이씨비와이', '음식점'],
    '9': ['참좋은참치', '음식점'],
  },

  {
    '0': ['커피.3(coffee.3)', '음식점'],
    '1': ['화덕피자&파스타', '음식점'],
    '2': ['도로도로커피숍', '카페'],
    '3': ['여기루', '음식점'],
    '4': ['피자파는집', '음식점'],
    '5': ['종로맛집', '음식점'],
    '6': ['아이씨비와이', '음식점'],
    '7': ['온 미 정', '음식점'],
    '8': ['참좋은참치', '음식점'],
    '9': ['한집한밥', '음식점'],
  },

{
'0': ['커피.3(coffee.3)', '음식점'],
'1': ['화덕피자&파스타', '음식점'],
'2': ['도로도로커피숍', '카페'],
'3': ['종로맛집', '음식점'],
'4': ['온 미 정', '음식점'],
'5': ['여기루', '음식점'],
'6': ['아이씨비와이', '음식점'],
'7': ['피자파는집', '음식점'],
'8': ['한집한밥', '음식점'],
'9': ['참좋은참치', '음식점'],
},

{
'0': ['커피.3(coffee.3)', '음식점'],
'1': ['화덕피자&파스타', '음식점'],
'2': ['도로도로커피숍', '카페'],
'3': ['종로맛집', '음식점'],
'4': ['온 미 정', '음식점'],
'5': ['피자파는집', '음식점'],
'6': ['한집한밥', '음식점'],
'7': ['아이씨비와이', '음식점'],
'8': ['더런드리카페', '카페'],
'9': ['미래사랑한식당', '음식점'],
},

{
'0': ['커피.3(coffee.3)', '음식점'],
'1': ['화덕피자&파스타', '음식점'],
'2': ['도로도로커피숍', '카페'],
'3': ['종로맛집', '음식점'],
'4': ['온 미 정', '음식점'],
'5': ['한집한밥', '음식점'],
'6': ['피자파는집', '음식점'],
'7': ['아이씨비와이', '음식점'],
'8': ['참좋은참치', '음식점'],
'9': ['더런드리카페', '카페'],
},

{
'0': ['커피.3(coffee.3)', '음식점'],
'1': ['화덕피자&파스타', '음식점'],
'2': ['도로도로커피숍', '카페'],
'3': ['참좋은참치', '음식점'],
'4': ['아이씨비와이', '음식점'],
'5': ['여기루', '음식점'],
'6': ['피자파는집', '음식점'],
'7': ['종로맛집', '음식점'],
'8': ['한집한밥', '음식점'],
'9': ['피팝 더 청담', '카페'],
},

{
'0': ['커피.3(coffee.3)', '음식점'],
'1': ['화덕피자&파스타', '음식점'],
'2': ['도로도로커피숍', '카페'],
'3': ['온 미 정', '음식점'],
'4': ['아이씨비와이', '음식점'],
'5': ['여기루', '음식점'],
'6': ['종로맛집', '음식점'],
'7': ['한집한밥', '음식점'],
'8': ['참좋은참치', '음식점'],
'9': ['가치', '음식점'],
},


];

